eisup_2019_docmng_integration/src/Documents/абс_РаспределяемыеДоходыРасходыСводнаяВедомость/абс_РаспределяемыеДоходыРасходыСводнаяВедомость.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>абс_РаспределяемыеДоходыРасходыСводнаяВедомость</name>
  <posting>Deny</posting>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.абс_СтатусыРаспределенияДоходовРасходов</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидОперацииРаспределния</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПричинаИзмененияСтатуса</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДокументыРаспределения</name>
    <attributes>
      <name>Документ</name>
      <type>
        <types>DocumentRef.абс_РаспределяемыеДоходыРасходы</types>
      </type>
    </attributes>
    <attributes>
      <name>Филиал</name>
      <type>
        <types>CatalogRef.Организации</types>
      </type>
    </attributes>
    <attributes>
      <name>ЦФУ</name>
      <type>
        <types>CatalogRef.абс_ЦФУ</types>
      </type>
    </attributes>
    <attributes>
      <name>ЦФО</name>
      <type>
        <types>CatalogRef.Подразделения</types>
      </type>
    </attributes>
    <attributes>
      <name>СтатьяБюджета</name>
      <type>
        <types>CatalogRef.СтатьиОборотовПоБюджетам</types>
      </type>
    </attributes>
    <attributes>
      <name>КодБУ</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КодУУ</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СчетДт</name>
      <type>
        <types>ChartOfAccountsRef.Хозрасчетный</types>
      </type>
    </attributes>
    <attributes>
      <name>СчетКт</name>
      <type>
        <types>ChartOfAccountsRef.Хозрасчетный</types>
      </type>
    </attributes>
    <attributes>
      <name>НоменклатурнаяГруппа</name>
      <type>
        <types>CatalogRef.НоменклатурныеГруппы</types>
      </type>
    </attributes>
    <attributes>
      <name>СтатьяЗатрат</name>
      <type>
        <types>CatalogRef.СтатьиЗатрат</types>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <type>
        <types>EnumRef.СтавкиНДС</types>
      </type>
    </attributes>
    <attributes>
      <name>ОбщаяСуммаКРаспределению</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

eisup_2019_docmng_integration/src/Enums/абс_СтатусыРаспределенияДоходовРасходов/абс_СтатусыРаспределенияДоходовРасходов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>абс_СтатусыРаспределенияДоходовРасходов</name>
  <enumValues>
    <name>Подготовка</name>
  </enumValues>
  <enumValues>
    <name>Отмена</name>
  </enumValues>
  <enumValues>
    <name>Уточнение</name>
  </enumValues>
  <enumValues>
    <name>Исполнение</name>
  </enumValues>
  <enumValues>
    <name>СогласованиеРуководителемБлока</name>
  </enumValues>
  <enumValues>
    <name>СогласованиеДЭФ</name>
  </enumValues>
  <enumValues>
    <name>ПереводВФилиал</name>
  </enumValues>
  <enumValues>
    <name>Отказ</name>
  </enumValues>
  <enumValues>
    <name>ПереводВКЦ</name>
  </enumValues>
  <enumValues>
    <name>ОбработкаБухгалтером</name>
  </enumValues>
</mdclass:Enum>

eisup_2019_docmng_integration/src/Documents/абс_РаспределяемыеДоходыРасходыСводнаяВедомость/ManagerModule.bsl
Процедура ПеревестиСтатусДокументов(МассивДокументов, Статус, Отказ = Ложь) Экспорт
	
	Для Каждого Документ из МассивДокументов Цикл 
		
		Если НЕ ЗначениеЗаполнено(Документ) Тогда 
			Продолжить;
		КонецЕсли;
		
		ДокументОбъект = Документ.ПолучитьОбъект();
		ДокументОбъект.Статус = Статус;
		
		Если Статус = Перечисления.абс_СтатусыРаспределенияДоходовРасходов.Исполнение Тогда 
			ДокументОбъект.СформироватьДвиженияПоОперации("-");	
		КонецЕсли;
		
		Если Статус = Перечисления.абс_СтатусыРаспределенияДоходовРасходов.ПереводВФилиал ИЛИ 
			Статус = Перечисления.абс_СтатусыРаспределенияДоходовРасходов.ПереводВКЦ Тогда
			ДокументОбъект.СформироватьДвиженияПоОперации("+");	
        КонецЕсли;
		
		Попытка 
			ДокументОбъект.Записать();
		Исключение
			Отказ = Истина;
		КонецПопытки;
		
	КонецЦикла;
	
КонецПроцедуры
